app/views/stories/show.json.jbuilder

json.set! :tasks do
  @story.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."story_id" = $1  [["story_id", 10]]