app/controllers/stories_controller.rb

UPDATE "stories" SET "assignee_id" = $1, "state" = $2, "updated_at" = $3 WHERE "stories"."id" = $4  [["assignee_id", 3], ["state", 1], ["updated_at", "2022-04-09 13:27:01.842963"], ["id", 10]]
---
  def update
    update_params, = story_params
    @story = find_story(params[:id])
    do_action { @story.update(update_params) } if allowed?